def imprime_shrek():
    print (" ⡴⠑⡄⠀⠀⠀⠀⠀⠀⠀ ⣀⣀⣤⣤⣤⣀⡀")
    print ("⠸⡇⠀⠿⡀⠀⠀⠀⣀⡴⢿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀")
    print ("⠀⠀⠀⠀⠑⢄⣠⠾⠁⣀⣄⡈⠙⣿⣿⣿⣿⣿⣿⣿⣿⣆ ")
    print ("⠀⠀⠀⠀⢀⡀⠁⠀⠀⠈⠙⠛⠂⠈⣿⣿⣿⣿⣿⠿⡿⢿⣆ ")
    print ("⠀⠀⠀⢀⡾⣁⣀⠀⠴⠂⠙⣗⡀⠀⢻⣿⣿⠭⢤⣴⣦⣤⣹⠀⠀⠀⢀⢴⣆ ")
    print ("⠀⠀⢀⣾⣿⣿⣿⣷⣮⣽⣾⣿⣥⣴⣿⣿⡿⢂⠔⢚⡿⢿⣿⣦⣴⣾⠸⣼⡿ ")
    print ("⠀⢀⡞⠁⠙⠻⠿⠟⠉⠀⠛⢹⣿⣿⣿⣿⣿⣌⢤⣼⣿⣾⣿⡟⠉ ")
    print ("⠀⣾⣷⣶⠇⠀⠀⣤⣄⣀⡀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇ ")
    print ("⠀⠉⠈⠉⠀⠀⢦⡈⢻⣿⣿⣿⣶⣶⣶⣶⣤⣽⡹⣿⣿⣿⣿⡇ ")
    print ("⠀⠀⠀⠀⠀⠀⠀⠉⠲⣽⡻⢿⣿⣿⣿⣿⣿⣿⣷⣜⣿⣿⣿ ")
    print ("⠀⠀ ⠀⠀⠀⠀⠀⢸⣿⣿⣷⣶⣮⣭⣽⣿⣿⣿⣿⣿⣿ ")

def imprime_zap():
    print (".   ⣀⣴⣶⠾⠿⠿⣶⣦⣄⠀⠀⠀ ")
    print ("⠀⢠⣾⠟⠉⠀⠀⠀⠀⠀⠈⠻⣷⡄⠀ ")
    print ("⢠⣿⠃⠀⣴⣶⠀⠀⠀⠀⠀⠀⠈⢿⡆ ")
    print ("⣼⡇⠀⠀⣿⣿⠁⠀⠀⠀⠀⠀⠀⢸⣿ ")
    print ("⢻⡇⠀⠀⠈⢻⣦⣀⢀⣤⣄⠀⠀⢸⣿ ")
    print ("⠘⣿⡄⠀⠀⠀⠈⠻⠿⣿⠿⠀⢀⣾⠇ ")
    print ("⠀⣿⠃⣀⡀⠀⠀⠀⠀⠀⢀⣴⡿⠃⠀ ")
    print ("⣸⠿⠟⠛⠻⠿⣶⣶⣶⠿⠟⠋ ")

print ("você quer o Zap ou o Shrek?")
comando=input()  
if comando =="shrek":
    imprime_shrek()

if comando =="zap":
    imprime_zap()